icoLagrangianFoam/tut/wavyChannel/system/mirrorMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      mirrorMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

planeType           pointAndNormal;

pointAndNormalDict
{
    basePoint       (-1 0 -0.5);
    normalVector    (0 1 0);
}

planeTolerance      1e-8;

// ************************************************************************* //
